// pages/introduce/introduce.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    apple:{
      url:"http://img5.imgtn.bdimg.com/it/u=3927785294,2227203319&fm=26&gp=0.jpg",
      title: "草莓",
      artcile: "草莓又叫红莓、洋莓、地莓等，是一种红色的花果。草莓的外观呈心形，鲜美红嫩，果肉多汁，含有特殊的浓郁水果芳香。草莓营养价值高，含丰富的维生素C ，有帮助消化的功效，与此同时，草莓还可以巩固齿龈，清新口气，润泽喉部。春季人的肝火往往比较旺盛，吃点草莓可以起到抑制作用。另外，草莓最好在饭后吃，因为其含有大量果胶及纤维素，可促进胃肠蠕动、帮助消化、改善便秘，预防痔疮、肠癌"
    },
    orange: {
      url: "http://img3.imgtn.bdimg.com/it/u=3802619374,751859391&fm=26&gp=0.jpg",
      title: "橘子",
      artcile: "橘子(tangerine)色彩鲜艳、酸甜可口，是秋冬季常见的美味佳果。橘子营养也十分丰富，1个橘子就几乎满足人体每天所需的维生素C量。橘子含有170余种植物化合物和60余种黄酮类化合物，其中的大多数物质均是天然抗氧化剂。橘子中丰富的营养成分有降血脂、抗动脉粥样硬化等作用，对于预防心血管疾病的发生大有益处。橘汁中含有一种名为“诺米林”的物质，具有抑制和杀死癌细胞的能力，对胃癌有防治作用"
    },
    Cherry: {
      url: "http://img4.imgtn.bdimg.com/it/u=2216317434,2022183256&fm=26&gp=0.jpg",
      title: "樱桃",
      artcile: "樱桃属于蔷薇科落叶乔木果树。樱桃成熟时颜色鲜红，玲珑剔透，味美形娇，营养丰富，医疗保健价值颇高，又有“含桃”的别称。 我国作为果树栽培的樱桃有中国樱桃、甜樱桃、酸樱桃和毛樱桃。樱桃成熟期早，有早春第一果的美誉。我国樱桃产量为3500万kg，人均只有29g，相当于每人有大樱桃3个或中国樱桃15--17个。可见樱桃具有广阔的市场前景。我国栽培的甜樱桃品种主要为欧美品种，在我国北方地区表现很好，"
    },
    Banana: {
      url: "http://img4.imgtn.bdimg.com/it/u=2313757501,3133275757&fm=26&gp=0.jpg",
      title: "香蕉",
      artcile: "芭蕉科(Musaceae)芭蕉属(Musa)植物，又指其果实，热带地区广泛栽培食用。香蕉味香、富於营养，终年可收获，在温带地区也很受重视。植株为大型草本，从根状茎发出，由叶鞘下部形成高3～6公尺(10～20呎)的假杆；叶长圆形至椭圆形，有的长达3～3.5公尺(10～11.5呎)，宽65公分(26吋)，10～20枚簇生茎顶。穗状花序大，由假杆顶端抽出，花多数，淡黄色；果序弯垂，结果10～20串，约50～150个。植株结果后枯死，由根状茎长出的吸根继续繁殖，每一根株可活多年。"
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})