// pages/shoufei/shoufei.js
Page({

  /**
   * 页面的初始数据
   */
  data: {

    process: [
      {
        tit: "① 前期沟通、了解客户需求",
        arc: "了解项目的具体需求、工作周期等细节。",
      },
      {
        tit: "② 设计方案的沟通 ",
        arc: "深入分析客户相关资料和行业资料，探讨设计概念和设计思路；充分了解客户对项目的需求和喜好，行程概念设计方案。",
      },
      {
        tit: "③ 签订设计协议",
        arc: "客户对设计方案认同，签订设计协议，并缴纳设计定金。",
      },
      {
        tit: "④ 设计方案的细化",
        arc: "设计项目设计完成，合作双方针对设计方案进行局部沟通，调整细节，形成设计方案。",
      },
      {
        tit: "⑤ 签定合同与支付预付款",
        arc: "双方就相互工作方式和思路取得共识，签订具有法律效力的合作合同；客户支付约定的预付款，并提供项目相关资料。",
      },
      {
        tit: "⑥ 设计执行与产品的定制化采购  ",
        arc: "有创造力的项目小组为客户进行视觉规划、设计创作；提供初步方案样稿，并由项目负责人直接针对方案向客户进行详细阐述说明；根据设计定稿进行软装产品的定制化采购。",
      },
      {
        tit: "⑦ 项目验收及尾款结算",
        arc: "客户验收软装产品无误后，签字确认并支付合同项目余款。",
      },
      {
        tit: "⑧ 现场软装搭配与产品摆场  ",
        arc: "项目设计师现场进行软装搭配，所有软装产品摆场。",
      },
      {
        tit: "⑨ 服务跟踪与售后",
        arc: "项目完成后，诺瑟兰软装根据客户需求提供其它的延伸设计及顾问咨询服务，以保持品牌风格的统一性及品牌视觉链的完整。",
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})